In [ ]:
import pandas as pd

In [ ]:
## UN datasets : http://data.un.org/
link = 'http://data.un.org/_Docs/SYB/CSV/SYB63_309_202009_Education.csv'

In [ ]:
df = pd.read_csv(link)

In [ ]:
df.head()

                   T06  ...                                         Unnamed: 6
0  Region/Country/Area  ...                                             Source
1                    1  ...  United Nations Educational, Scientific and Cul...
2                    1  ...  United Nations Educational, Scientific and Cul...
3                    1  ...  United Nations Educational, Scientific and Cul...
4                    1  ...  United Nations Educational, Scientific and Cul...

[5 rows x 7 columns]

The first row does not contain useful information. We should use `skiprows` parameter

In [ ]:
df = pd.read_csv(link, skiprows=1)

In [ ]:
df

      Region/Country/Area  ...                                             Source
0                       1  ...  United Nations Educational, Scientific and Cul...
1                       1  ...  United Nations Educational, Scientific and Cul...
2                       1  ...  United Nations Educational, Scientific and Cul...
3                       1  ...  United Nations Educational, Scientific and Cul...
4                       1  ...  United Nations Educational, Scientific and Cul...
...                   ...  ...                                                ...
8848                  716  ...  United Nations Educational, Scientific and Cul...
8849                  716  ...  United Nations Educational, Scientific and Cul...
8850                  716  ...  United Nations Educational, Scientific and Cul...
8851                  716  ...  United Nations Educational, Scientific and Cul...
8852                  716  ...  United Nations Educational, Scientific and Cul...

[8853 rows x 7 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8853 entries, 0 to 8852
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Region/Country/Area  8853 non-null   int64
 1   Unnamed: 1           8853 non-null   object
 2   Year                 8853 non-null   int64
 3   Series               8853 non-null   object
 4   Value                8853 non-null   float64
 5   Footnotes            801 non-null    object
 6   Source               8853 non-null   object
dtypes: float64(1), int64(2), object(4)
memory usage: 484.3+ KB

It seems that `Region..` and `Source` columns have no value. Let's investigate them!

In [ ]:
df['Region/Country/Area'].value_counts()

862    62
204    62
268    61
120    60
356    57
       ..
736     7
706     6
530     3
850     1
16      1
Name: Region/Country/Area, Length: 224, dtype: int64

In [ ]:
df['Source'].value_counts()

United Nations Educational, Scientific and Cultural Organization (UNESCO), Montreal, the UNESCO Institute for Statistics (UIS) statistics database, last accessed May 2020.    8853
Name: Source, dtype: int64

So, let's drop them!

In [ ]:
df1 = df.drop(['Region/Country/Area','Source'], axis=1)

In [ ]:
df1.head()

                      Unnamed: 1  Year  ...        Value  Footnotes
0  Total, all countries or areas  2005  ...  678920.8179        NaN
1  Total, all countries or areas  2005  ...     104.5005        NaN
2  Total, all countries or areas  2005  ...      99.7310        NaN
3  Total, all countries or areas  2005  ...  509254.2941        NaN
4  Total, all countries or areas  2005  ...      65.7811        NaN

[5 rows x 5 columns]

It seems that the titles of column aren't fine ones, so let's change them!

In [ ]:
df1.columns = ['Region/Country/Area','Year','Data','Enrollments (Thousands)','Footnotes']

In [ ]:
df1.head()

             Region/Country/Area  Year  ... Enrollments (Thousands)  Footnotes
0  Total, all countries or areas  2005  ...             678920.8179        NaN
1  Total, all countries or areas  2005  ...                104.5005        NaN
2  Total, all countries or areas  2005  ...                 99.7310        NaN
3  Total, all countries or areas  2005  ...             509254.2941        NaN
4  Total, all countries or areas  2005  ...                 65.7811        NaN

[5 rows x 5 columns]

Is the column `Footnotes` useful?

In [ ]:
df1['Footnotes'].value_counts()

Estimate.    801
Name: Footnotes, dtype: int64

In [ ]:
df1['Footnotes'].unique()

array([nan, 'Estimate.'], dtype=object)

Maybe, let's keep it!

Let's test the type of `Enrollments (Thousands)` column

In [ ]:
type(df1['Enrollments (Thousands)'][40])

numpy.float64

A function to convert the strings in Value column to floating point numbers

In [ ]:
def to_numeric(val):
    """
    Converts a given string (with one or more commas) to a numeric value
    """
    if ',' not in str(val):
        result = float(val)
    else:
        val=str(val)
        val=''.join(str(val).split(','))
        result=float(val)
    return result

Use the `apply()` method to apply this function to the `Value` column data

In [ ]:
df1['Enrollments (Thousands)'] = df1['Enrollments (Thousands)'].apply(to_numeric)

What about the `Data` column!

In [ ]:
df1['Data'].value_counts()

Students enrolled in primary education (thousands)      1160
Gross enrollment ratio - Primary (male)                 1099
Gross enrollment ratio - Primary (female)               1099
Students enrolled in secondary education (thousands)    1015
Gross enrollment ratio - Secondary (male)                951
Gross enrollment ratio - Secondary (female)              951
Students enrolled in tertiary education (thousands)      910
Gross enrollment ratio - Tertiary (male)                 834
Gross enrollment ratio - Tertiary (female)               834
Name: Data, dtype: int64

In [ ]:
df1['Data'].unique()

array(['Students enrolled in primary education (thousands)',
       'Gross enrollment ratio - Primary (male)',
       'Gross enrollment ratio - Primary (female)',
       'Students enrolled in secondary education (thousands)',
       'Gross enrollment ratio - Secondary (male)',
       'Gross enrollment ratio - Secondary (female)',
       'Students enrolled in tertiary education (thousands)',
       'Gross enrollment ratio - Tertiary (male)',
       'Gross enrollment ratio - Tertiary (female)'], dtype=object)

Let's create 3 different datasets

In [ ]:
df_primary   = df1[df1['Data']=='Students enrolled in primary education (thousands)']
df_secondary = df1[df1['Data']=='Students enrolled in secondary education (thousands)']
df_tertiary  = df1[df1['Data']=='Students enrolled in tertiary education (thousands)']

In [ ]:
df_primary

                Region/Country/Area  Year  ... Enrollments (Thousands)  Footnotes
0     Total, all countries or areas  2005  ...             678920.8179        NaN
9     Total, all countries or areas  2010  ...             697001.1514        NaN
18    Total, all countries or areas  2014  ...             715427.0483        NaN
27    Total, all countries or areas  2015  ...             720012.3414        NaN
36    Total, all countries or areas  2018  ...             750739.3790  Estimate.
...                             ...   ...  ...                     ...        ...
8823                         Zambia  2014  ...               3217.8720        NaN
8826                         Zambia  2015  ...               3215.7230        NaN
8829                         Zambia  2017  ...               3284.8410        NaN
8832                       Zimbabwe  2003  ...               2361.5880        NaN
8841                       Zimbabwe  2013  ...               2663.1870        NaN

[1160 rows x 5 columns]

In [ ]:
df_secondary

                Region/Country/Area  Year  ... Enrollments (Thousands)  Footnotes
3     Total, all countries or areas  2005  ...             509254.2941        NaN
12    Total, all countries or areas  2010  ...             546192.2096        NaN
21    Total, all countries or areas  2014  ...             580892.5288        NaN
30    Total, all countries or areas  2015  ...             582977.1460        NaN
39    Total, all countries or areas  2018  ...             594663.1921  Estimate.
...                             ...   ...  ...                     ...        ...
8793                          Yemen  2011  ...               1643.1160        NaN
8802                          Yemen  2013  ...               1768.1020        NaN
8808                          Yemen  2016  ...               1915.8710        NaN
8835                       Zimbabwe  2003  ...                758.2290        NaN
8844                       Zimbabwe  2013  ...                957.4610        NaN

[1015 rows x 5 columns]

In [ ]:
df_tertiary

                Region/Country/Area  Year  ... Enrollments (Thousands)  Footnotes
6     Total, all countries or areas  2005  ...             139578.2491        NaN
15    Total, all countries or areas  2010  ...             182257.6784        NaN
24    Total, all countries or areas  2014  ...             213025.3551        NaN
33    Total, all countries or areas  2015  ...             217626.6071        NaN
42    Total, all countries or areas  2018  ...             223671.8735  Estimate.
...                             ...   ...  ...                     ...        ...
8796                          Yemen  2011  ...                267.4980        NaN
8820                         Zambia  2012  ...                 56.6800        NaN
8838                       Zimbabwe  2010  ...                 94.6110        NaN
8847                       Zimbabwe  2013  ...                 94.1150        NaN
8850                       Zimbabwe  2015  ...                135.5750        NaN

[910 rows x 5 columns]

Let's compare 2 countries data, USA and Australia

In [ ]:
primary_enrollment_Australia = df_primary[df_primary['Region/Country/Area']=='Australia']
primary_enrollment_USA = df_primary[df_primary['Region/Country/Area']=='United States of America']

In [ ]:
primary_enrollment_Australia

    Region/Country/Area  Year  ... Enrollments (Thousands)  Footnotes
901           Australia  2005  ...                1934.941        NaN
904           Australia  2010  ...                2015.017        NaN
907           Australia  2014  ...                2168.531        NaN
910           Australia  2015  ...                2140.571        NaN
919           Australia  2017  ...                2216.779        NaN

[5 rows x 5 columns]

In [ ]:
primary_enrollment_USA

           Region/Country/Area  Year  ... Enrollments (Thousands)  Footnotes
8529  United States of America  2014  ...              24538.3710        NaN
8538  United States of America  2015  ...              24785.6970        NaN
8547  United States of America  2017  ...              25123.6772        NaN

[3 rows x 5 columns]

What was the first year in the `Year` column?

In [ ]:
df1['Year'].value_counts()

2005    1446
2015    1430
2010    1421
2014    1414
2018     751
2017     708
2009     232
2004     194
2012     190
2013     181
2016     177
2003     104
2008     103
2011     102
2002      94
2006      76
2000      71
2007      67
2001      59
2019      33
Name: Year, dtype: int64

In [ ]:
missing_years = [y for y in range(2000,2005)] + [y for y in range(2006,2010)] + [y for y in range(2011,2014)] + [2016] + [y for y in range(2018,2020)]
missing_years

[2000,
 2001,
 2002,
 2003,
 2004,
 2006,
 2007,
 2008,
 2009,
 2011,
 2012,
 2013,
 2016,
 2018,
 2019]

Let's create a dictionary for missing data

In [ ]:
import numpy as np

In [ ]:
dict_missing = {'Region/Country/Area':['Australia']*15,
                'Year':missing_years,
                'Data':'Students enrolled in primary education (thousands)'*15,
                'Enrollments (Thousands)':[np.nan]*15,
                'Footnotes':[np.nan]*15
                }

In [ ]:
df_missing = pd.DataFrame(data = dict_missing)

let's paste the missed parts

In [ ]:
primary_enrollment_Australia = primary_enrollment_Australia.append(df_missing , ignore_index=True , sort=True)

In [ ]:
primary_enrollment_Australia

                                                 Data  ...  Year
0   Students enrolled in primary education (thousa...  ...  2005
1   Students enrolled in primary education (thousa...  ...  2010
2   Students enrolled in primary education (thousa...  ...  2014
3   Students enrolled in primary education (thousa...  ...  2015
4   Students enrolled in primary education (thousa...  ...  2017
5   Students enrolled in primary education (thousa...  ...  2000
6   Students enrolled in primary education (thousa...  ...  2001
7   Students enrolled in primary education (thousa...  ...  2002
8   Students enrolled in primary education (thousa...  ...  2003
9   Students enrolled in primary education (thousa...  ...  2004
10  Students enrolled in primary education (thousa...  ...  2006
11  Students enrolled in primary education (thousa...  ...  2007
12  Students enrolled in primary education (thousa...  ...  2008
13  Students enrolled in primary education (thousa...  ...  2009
14  Students enrolled in primary education (thousa...  ...  2011
15  Students enrolled in primary education (thousa...  ...  2012
16  Students enrolled in primary education (thousa...  ...  2013
17  Students enrolled in primary education (thousa...  ...  2016
18  Students enrolled in primary education (thousa...  ...  2018
19  Students enrolled in primary education (thousa...  ...  2019

[20 rows x 5 columns]

Let's sort the data frame based on year

In [ ]:
primary_enrollment_Australia.sort_values(['Year'], inplace=True)

In [ ]:
primary_enrollment_Australia

                                                 Data  ...  Year
5   Students enrolled in primary education (thousa...  ...  2000
6   Students enrolled in primary education (thousa...  ...  2001
7   Students enrolled in primary education (thousa...  ...  2002
8   Students enrolled in primary education (thousa...  ...  2003
9   Students enrolled in primary education (thousa...  ...  2004
0   Students enrolled in primary education (thousa...  ...  2005
10  Students enrolled in primary education (thousa...  ...  2006
11  Students enrolled in primary education (thousa...  ...  2007
12  Students enrolled in primary education (thousa...  ...  2008
13  Students enrolled in primary education (thousa...  ...  2009
1   Students enrolled in primary education (thousa...  ...  2010
14  Students enrolled in primary education (thousa...  ...  2011
15  Students enrolled in primary education (thousa...  ...  2012
16  Students enrolled in primary education (thousa...  ...  2013
2   Students enrolled in primary education (thousa...  ...  2014
3   Students enrolled in primary education (thousa...  ...  2015
17  Students enrolled in primary education (thousa...  ...  2016
4   Students enrolled in primary education (thousa...  ...  2017
18  Students enrolled in primary education (thousa...  ...  2018
19  Students enrolled in primary education (thousa...  ...  2019

[20 rows x 5 columns]

In [ ]:
primary_enrollment_Australia.reset_index(inplace=True , drop=True)

In [ ]:
primary_enrollment_Australia

                                                 Data  ...  Year
0   Students enrolled in primary education (thousa...  ...  2000
1   Students enrolled in primary education (thousa...  ...  2001
2   Students enrolled in primary education (thousa...  ...  2002
3   Students enrolled in primary education (thousa...  ...  2003
4   Students enrolled in primary education (thousa...  ...  2004
5   Students enrolled in primary education (thousa...  ...  2005
6   Students enrolled in primary education (thousa...  ...  2006
7   Students enrolled in primary education (thousa...  ...  2007
8   Students enrolled in primary education (thousa...  ...  2008
9   Students enrolled in primary education (thousa...  ...  2009
10  Students enrolled in primary education (thousa...  ...  2010
11  Students enrolled in primary education (thousa...  ...  2011
12  Students enrolled in primary education (thousa...  ...  2012
13  Students enrolled in primary education (thousa...  ...  2013
14  Students enrolled in primary education (thousa...  ...  2014
15  Students enrolled in primary education (thousa...  ...  2015
16  Students enrolled in primary education (thousa...  ...  2016
17  Students enrolled in primary education (thousa...  ...  2017
18  Students enrolled in primary education (thousa...  ...  2018
19  Students enrolled in primary education (thousa...  ...  2019

[20 rows x 5 columns]

Let's fill the `Enrollments (Thousands)` column

In [ ]:
primary_enrollment_Australia.interpolate(inplace=True)

In [ ]:
primary_enrollment_Australia

                                                 Data  ...  Year
0   Students enrolled in primary education (thousa...  ...  2000
1   Students enrolled in primary education (thousa...  ...  2001
2   Students enrolled in primary education (thousa...  ...  2002
3   Students enrolled in primary education (thousa...  ...  2003
4   Students enrolled in primary education (thousa...  ...  2004
5   Students enrolled in primary education (thousa...  ...  2005
6   Students enrolled in primary education (thousa...  ...  2006
7   Students enrolled in primary education (thousa...  ...  2007
8   Students enrolled in primary education (thousa...  ...  2008
9   Students enrolled in primary education (thousa...  ...  2009
10  Students enrolled in primary education (thousa...  ...  2010
11  Students enrolled in primary education (thousa...  ...  2011
12  Students enrolled in primary education (thousa...  ...  2012
13  Students enrolled in primary education (thousa...  ...  2013
14  Students enrolled in primary education (thousa...  ...  2014
15  Students enrolled in primary education (thousa...  ...  2015
16  Students enrolled in primary education (thousa...  ...  2016
17  Students enrolled in primary education (thousa...  ...  2017
18  Students enrolled in primary education (thousa...  ...  2018
19  Students enrolled in primary education (thousa...  ...  2019

[20 rows x 5 columns]

Let's fill the `Enrollments (Thousands)` column backward 5 rows before 2005

In [ ]:
primary_enrollment_Australia.interpolate(method='linear', limit_direction='backward', limit=5)

                                                 Data  ...  Year
0   Students enrolled in primary education (thousa...  ...  2000
1   Students enrolled in primary education (thousa...  ...  2001
2   Students enrolled in primary education (thousa...  ...  2002
3   Students enrolled in primary education (thousa...  ...  2003
4   Students enrolled in primary education (thousa...  ...  2004
5   Students enrolled in primary education (thousa...  ...  2005
6   Students enrolled in primary education (thousa...  ...  2006
7   Students enrolled in primary education (thousa...  ...  2007
8   Students enrolled in primary education (thousa...  ...  2008
9   Students enrolled in primary education (thousa...  ...  2009
10  Students enrolled in primary education (thousa...  ...  2010
11  Students enrolled in primary education (thousa...  ...  2011
12  Students enrolled in primary education (thousa...  ...  2012
13  Students enrolled in primary education (thousa...  ...  2013
14  Students enrolled in primary education (thousa...  ...  2014
15  Students enrolled in primary education (thousa...  ...  2015
16  Students enrolled in primary education (thousa...  ...  2016
17  Students enrolled in primary education (thousa...  ...  2017
18  Students enrolled in primary education (thousa...  ...  2018
19  Students enrolled in primary education (thousa...  ...  2019

[20 rows x 5 columns]